import { SvgProps } from "../types";

export default ({ color, size = 24 }: SvgProps) => {
    return (
        <svg
            width={size}
            height={size}
            viewBox="0 0 24 24"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
        >
            <title>Scholar Search_icon_hlighted</title>
            <g
                id="页面-1"
                stroke="none"
                strokeWidth="1"
                fill="none"
                fillRule="evenodd"
            >
                <g
                    id="Scholar-Search_默认状态备份"
                    transform="translate(-58.000000, -291.000000)"
                >
                    <g
                        id="左侧边栏"
                        transform="translate(30.000000, 128.000000)"
                    >
                        <g id="list" transform="translate(0.000000, 60.000000)">
                            <g
                                id="Scholar-Search"
                                transform="translate(0.000000, 92.000000)"
                            >
                                <g
                                    id="Scholar-Search_icon_hlighted"
                                    transform="translate(28.000000, 11.000000)"
                                >
                                    <rect
                                        id="矩形"
                                        fill="#D8D8D8"
                                        opacity="0"
                                        x="0"
                                        y="0"
                                        width="24"
                                        height="24"
                                    ></rect>
                                    <g
                                        id="编组备份-2"
                                        transform="translate(2.625397, 4.781119)"
                                    >
                                        <path
                                            d="M15.274,7.26888079 L15.2746031,10.6786239 C15.2741554,11.6524326 14.7295681,12.5443857 13.8631767,12.9900612 C12.5094096,13.6851953 10.9773125,14.0314808 9.27460306,14.0314808 C7.5718936,14.0314808 6.03979652,13.6851953 4.68563976,12.9898609 C3.81963805,12.5443857 3.27505072,11.6524326 3.27460306,10.6783481 L3.274,7.26888079 L7.39807878,8.93665339 C8.51259829,9.38742527 9.77578548,9.41747673 10.9101273,9.02680776 L11.1511274,8.93665339 L15.274,7.26888079 Z"
                                            id="形状结合"
                                            fill="#1886F2"
                                            fillRule="nonzero"
                                        ></path>
                                        <path
                                            d="M7.39807878,0.362227406 C8.59220683,-0.120742469 9.9569993,-0.120742469 11.1511274,0.362227406 L17.8976669,3.09089235 C18.4523317,3.31522878 18.7010714,3.90411074 18.4532424,4.40619703 C18.3427595,4.63002861 18.1449381,4.8090978 17.8976669,4.90910765 L11.1511274,7.63777259 C9.9569993,8.12074247 8.59220683,8.12074247 7.39807878,7.63777259 L0.651539251,4.90910765 C0.0968743845,4.68477122 -0.151865245,4.09588926 0.0959637373,3.59380297 C0.206446642,3.36997139 0.404267988,3.1909022 0.651539251,3.09089235 L7.39807878,0.362227406 Z"
                                            id="路径备份-2"
                                            fill="#1886F2"
                                            fillRule="nonzero"
                                        ></path>
                                        <line
                                            x1="17.8979195"
                                            y1="4"
                                            x2="17.8979195"
                                            y2="9.44232066"
                                            id="路径"
                                            stroke="#1886F2"
                                            strokeWidth="1.3"
                                            strokeLinecap="round"
                                            strokeLinejoin="round"
                                        ></line>
                                    </g>
                                </g>
                            </g>
                        </g>
                    </g>
                </g>
            </g>
        </svg>
    );
};
